from Source.Core.Manager import Manager
from Source.Core.Logger import Logger
from Source.Core.Temper import Temper

class Objects:
	"""Коллекция рабочих объектов."""

	#==========================================================================================#
	# >>>>> СТАТИЧЕСКИЕ СВОЙСТВА <<<<< #
	#==========================================================================================#

	# Логические переключатели.
	FORCE_MODE = False
	REMOVE_LOG = False
	SHUTDOWN = False

	# Сообщения внутренним обработчикам.
	MSG_FORCE_MODE = ""
	MSG_SHUTDOWN = ""

	#==========================================================================================#
	# >>>>> СВОЙСТВА ТОЛЬКО ДЛЯ ЧТЕНИЯ <<<<< #
	#==========================================================================================#

	@property
	def logger(self) -> Logger:
		"""Менеджер логов."""

		return self.__Logger

	@property
	def manager(self) -> Manager:
		"""Менеджер парсеров"""

		return self.__Manager

	@property
	def temper(self) -> Temper:
		"""Дескриптор каталога временных файлов."""

		return self.__Temper

	#==========================================================================================#
	# >>>>> МЕТОДЫ <<<<< #
	#==========================================================================================#

	def __init__(self):

		#---> Генерация динамических свойств.
		#==========================================================================================#
		# Менеджер парсеров.
		self.__Manager = Manager(self)
		# Менеджер логов.
		self.__Logger = Logger()
		# Дескриптор каталога временных файлов.
		self.__Temper = Temper()