from Source.Core.ParsersManager import ParsersManager
from Source.Core.Logger import Logger

class Objects:
	"""Коллекция рабочих объектов."""

	#==========================================================================================#
	# >>>>> СТАТИЧЕСКИЕ СВОЙСТВА <<<<< #
	#==========================================================================================#

	# Логические переключатели.
	FORCE_MODE = False
	REMOVE_LOG = False
	SHUTDOWN = False

	# Сообщения внутренним обработчикам.
	MSG_FORCE_MODE = ""
	MSG_SHUTDOWN = ""

	#==========================================================================================#
	# >>>>> СВОЙСТВА ТОЛЬКО ДЛЯ ЧТЕНИЯ <<<<< #
	#==========================================================================================#

	@property
	def logger(self) -> Logger:
		"""Менеджер логов."""

		return self.__Logger

	@property
	def parsers_manager(self) -> ParsersManager:
		"""Менеджер парсеров"""

		return self.__ParsersManager

	#==========================================================================================#
	# >>>>> МЕТОДЫ <<<<< #
	#==========================================================================================#

	def __init__(self):

		#---> Генерация динамических свойств.
		#==========================================================================================#
		# Менеджер парсеров.
		self.__ParsersManager = ParsersManager()
		# Менеджер логов.
		self.__Logger = Logger()