from Source.Core.Manager import Manager
from Source.Core.Logger import Logger
from Source.Core.Temper import Temper

class SystemObjects:
	"""Коллекция системных объектов."""

	#==========================================================================================#
	# >>>>> СТАТИЧЕСКИЕ СВОЙСТВА <<<<< #
	#==========================================================================================#

	FORCE_MODE = False
	REMOVE_LOG = False
	SHUTDOWN = False

	MSG_FORCE_MODE = ""
	MSG_SHUTDOWN = ""

	PARSER_NAME = None

	#==========================================================================================#
	# >>>>> СВОЙСТВА ТОЛЬКО ДЛЯ ЧТЕНИЯ <<<<< #
	#==========================================================================================#

	@property
	def logger(self) -> Logger:
		"""Менеджер логов."""

		return self.__Logger

	@property
	def manager(self) -> Manager:
		"""Менеджер парсеров"""

		return self.__Manager

	@property
	def temper(self) -> Temper:
		"""Дескриптор каталога временных файлов."""

		return self.__Temper

	#==========================================================================================#
	# >>>>> МЕТОДЫ <<<<< #
	#==========================================================================================#

	def __init__(self):
		"""Коллекция системных объектов."""

		#---> Генерация динамических свойств.
		#==========================================================================================#
		self.__Manager = Manager(self)
		self.__Logger = Logger()
		self.__Temper = Temper()