from Source.Core.SystemObjects.Driver import Driver
from Source.Core.SystemObjects.Logger import Logger
from Source.Core.SystemObjects.Temper import Temper

from dulwich import porcelain

#==========================================================================================#
# >>>>> ВСПОМОГАТЕЛЬНЫЕ СТРУКТУРЫ ДАННЫХ <<<<< #
#==========================================================================================#

class GlobalFlag:
	"""Глоабльный флаг."""

	#==========================================================================================#
	# >>>>> СВОЙСТВА <<<<< #
	#==========================================================================================#

	@property
	def status(self) -> bool:
		"""Статус активации флага."""

		return self.__Value

	#==========================================================================================#
	# >>>>> ПУБЛИЧНЫЕ МЕТОДЫ <<<<< #
	#==========================================================================================#

	def __init__(self, status: bool):
		"""Глоабльный флаг."""

		self.__Value = status

	def __bool__(self) -> bool:
		"""Интерпретирует объект в логическое значение."""

		return self.__Value

	def disable(self):
		"""Отключает флаг."""

		self.__Value = False

	def enable(self):
		"""Включает флаг."""

		self.__Value = True

	def set_status(self, status: bool):
		"""
		Задаёт статус активации флага.

		:param status: Статус активации.
		:type status: bool
		"""

		self.__Value = status

#==========================================================================================#
# >>>>> ОСНОВНОЙ КЛАСС <<<<< #
#==========================================================================================#

class SystemObjects:
	"""Коллекция системных объектов."""

	#==========================================================================================#
	# >>>>> ГЛОБАЛЬНЫЕ ФЛАГИ <<<<< #
	#==========================================================================================#

	@property
	def CACHING(self) -> GlobalFlag:
		"""Глоабльный флаг: включено ли кэширование объектов."""

		return self.__CachingEnabled

	@property
	def FORCE_MODE(self) -> GlobalFlag:
		"""Глоабльный флаг: включен ли режим перезаписи."""

		return self.__ForceMode

	#==========================================================================================#
	# >>>>> СВОЙСТВА <<<<< #
	#==========================================================================================#

	@property
	def MELON_VERSION(self) -> str:
		"""Используемая версия Melon."""

		return porcelain.tag_list(".")[-1].decode().lstrip("v")
	
	@property
	def EXIT_CODE(self) -> int:
		"""Код завершения. При успешнов выполнении 0."""

		return self.__ExitCode
	
	@EXIT_CODE.setter
	def EXIT_CODE(self, code: int):
		"""
		Задаёт код завершения.

		:param code: Код завершения.
		:type code: int
		"""

		self.__ExitCode = code

	#==========================================================================================#
	# >>>>> СИСТЕМНЫЕ ОБЪЕКТЫ <<<<< #
	#==========================================================================================#

	@property
	def driver(self) -> Driver:
		"""Менеджер парсеров"""

		return self.__Driver

	@property
	def logger(self) -> Logger:
		"""Менеджер портов CLI и логов."""

		return self.__Logger
	
	@property
	def temper(self) -> Temper:
		"""Дескриптор каталога временных файлов."""

		return self.__Temper

	#==========================================================================================#
	# >>>>> ПУБЛИЧНЫЕ МЕТОДЫ <<<<< #
	#==========================================================================================#

	def __init__(self):
		"""Коллекция системных объектов."""

		self.__Driver = Driver(self)
		self.__Logger = Logger(self)
		self.__Temper = Temper()

		self.__ForceMode = GlobalFlag(False)
		self.__CachingEnabled = GlobalFlag(True)
		self.__ExitCode = 0